# encoding: utf-8
require 'nokogiri'

module Spider
  class Coo8Parser < Parser
    
    
    CATEGORY_MAP = [
      ["大家电-空调","家电/办公-生活家电-空调"],
      ["大家电-冰箱","家电/办公-生活家电-冰箱"],
      ["大家电-平板电视","家电/办公-生活家电-液晶电视"],
      ["大家电-洗衣机","家电/办公-生活家电-洗衣机"],
      ["大家电-冷柜","家电/办公-厨房家电-酒柜/冷柜"],
      ["大家电-烘干机","家电/办公-小家电-熨斗"],

      ["大家电-家庭影院","家电/办公-生活家电-家庭影院"],
      ["大家电-迷你音响","家电/办公-生活家电-音响 DVD"],
      ["大家电-AV功放","家电/办公-生活家电-音响 DVD"],
      ["大家电-DVD碟机","家电/办公-生活家电-音响 DVD"],
      ["大家电-硬盘播放机","家电/办公-生活家电-音响 DVD"],

      ["大家电-家电配件","家电/办公-生活家电-家电配件"],

      ["厨卫电器-油烟机","家电/办公-厨房家电-燃气灶"],
      ["厨卫电器-灶具","家电/办公-厨房家电-燃气灶"],
      ["厨卫电器-消毒柜","家电/办公-厨房家电-消毒柜/洗碗机"],
      ["厨卫电器-洗碗机","家电/办公-厨房家电-消毒柜/洗碗机"],

      ["厨卫电器-豆浆机","家电/办公-厨房家电-消毒柜/洗碗机"],
      ["厨卫电器-电压力锅","家电/办公-厨房家电-电压力锅"],
      ["厨卫电器-榨汁/料理机","家电/办公-厨房家电-榨汁机"],
      ["厨卫电器-电烤箱/烧烤炉","家电/办公-厨房家电-电烤箱"],
      ["厨卫电器-电磁炉","家电/办公-厨房家电-电磁炉"],
      ["厨卫电器-电饭煲/西施煲","家电/办公-厨房家电-电饭煲"],
      ["厨卫电器-电水煲/电水壶","家电/办公-厨房家电-电水壶"],
      ["厨卫电器-微波炉","家电/办公-厨房家电-微波炉"],
      ["厨卫电器-酸奶机","家电/办公-厨房家电-酸奶机"],
      ["厨卫电器-咖啡壶/咖啡机","家电/办公-厨房家电-咖啡机"],
      ["厨卫电器-电饼铛/煎烤机","家电/办公-厨房家电-电烤箱"],
      ["厨卫电器-打蛋器/煮蛋器","家电/办公-厨房家电-煮蛋器"],
      ["厨卫电器-多士炉/面包机","家电/办公-厨房家电-面包机"],

      ["精品家居-炒锅","家居家纺-厨房用具-炒锅"],
      ["精品家居-煎锅","家居家纺-厨房用具-煎锅"],
      ["精品家居-压力锅","家居家纺-厨房用具-压力锅"],

      ["厨卫电器-软水机","家电/办公-厨房家电-净化器"],
      ["厨卫电器-净水机","家电/办公-厨房家电-净化器"],
      ["厨卫电器-管线机","家电/办公-厨房家电-净化器"],
      ["厨卫电器-前置过滤器","家电/办公-厨房家电-净化器"],

      ["厨卫电器-热水器","家电/办公-生活家电-热水器"],
      ["厨卫电器-浴霸","家电/办公-小家电-浴霸"],


      ["生活电器-电风扇","家电/办公-生活家电-电风扇"],
      ["生活电器-冷风机","家电/办公-生活家电-空调"],
      ["生活电器-饮水机","家电/办公-厨房家电-饮水机"],
      ["生活电器-净水桶","家电/办公-厨房家电-净化器"],
      ["生活电器-净化器","家电/办公-厨房家电-净化器"],
      ["生活电器-吸尘器","家电/办公-生活家电-吸尘器"],
      ["生活电器-加湿器","家电/办公-生活家电-加湿器"],
      ["生活电器-除湿机","家电/办公-生活家电-空调"],

      ["生活电器-剃须刀","家电/办公-小家电-剃须刀"],
      ["生活电器-电吹风","家电/办公-小家电-电吹风"],
      ["生活电器-美发器","美容护肤-身体护理-洗发护发"],
      ["生活电器-美容器","美容护肤-魅力彩妆-美容工具"],

      #["个人护理-按摩保健","美容护肤-身体护理-个护保健"],
      ["生活电器-按摩器","家电/办公-生活家电-按摩器"],

      ["生活电器-挂烫机","家居家纺-生活日用-洗晒用品"],
      ["生活电器-电熨斗","家电/办公-小家电-熨斗"],
      ["生活电器-缝纫机","家居家纺-生活日用-缝纫用品"],

      #["日用家居-拖线插座","家居家纺-家装建材-插座"],

      ["手机数码-手机","电脑手机数码-手机通讯-普通手机"],
      #["手机通讯-WCDMA(联通3G手机)","电脑手机数码-手机通讯-智能手机"],
      #["手机通讯-GSM/CDMA双模手机","电脑手机数码-手机通讯-普通手机"],
      #["手机通讯-GSM/CDMA2000双模手机","电脑手机数码-手机通讯-普通手机"],
      #["手机通讯-CDMA2000（电信3G）手机","电脑手机数码-手机通讯-智能手机"],
      #["手机通讯-双卡手机","电脑手机数码-手机通讯-普通手机"],
     # ["手机通讯-CDMA手机","电脑手机数码-手机通讯-普通手机"],

      ["手机数码-电池","电脑手机数码-手机配件-手机电池"],
      #["电池-国产适配","电脑手机数码-手机配件-手机电池"],

      ["手机数码-充电器","电脑手机数码-手机配件-手机充电器"],
      #["充电器-线充","电脑手机数码-手机配件-手机充电器"],
      #["充电器-座充","电脑手机数码-手机配件-手机充电器"],
      #["充电器-车载充电器","电脑手机数码-手机配件-手机充电器"],

      ["手机数码-存储卡","电脑手机数码-手机配件-手机存储卡"],
      #["存储卡-4G存储卡","电脑手机数码-手机配件-手机存储卡"],
      #["存储卡-8G存储卡","电脑手机数码-手机配件-手机存储卡"],
      #["存储卡-16G存储卡","电脑手机数码-手机配件-手机存储卡"],
      #["存储卡-32G存储卡","电脑手机数码-手机配件-手机存储卡"],

      ["手机数码-手机耳机","电脑手机数码-手机配件-手机耳机"],
      #["手机数码-耳机-蓝牙耳机","电脑手机数码-手机配件-手机耳机"],

      ["手机数码-其他配件","电脑手机数码-手机配件-其它配件"],
      #["其他配件-贴膜","电脑手机数码-手机配件-手机贴膜"],
      #["其他配件-读卡器","电脑手机数码-手机配件-其它配件"],
      #["其他配件-防辐射贴片","电脑手机数码-手机配件-其它配件"],

      ["手机数码-便携相机","电脑手机数码-数码摄像-便携相机"],
      ["手机数码-数码摄像机","电脑手机数码-数码摄像-数码摄像机"],
      ["手机数码-单反相机","电脑手机数码-数码摄像-单反相机"],
      ["手机数码-单电相机","电脑手机数码-数码摄像-单电/微单相机"],
      ["手机数码-单反镜头","电脑手机数码-数码摄像-单反镜头"],
      ["手机数码-数码相框","电脑手机数码-数码摄像-数码相框"],

      ["手机数码-滤镜","电脑手机数码-数码摄像-滤镜"],
      ["手机数码-电池/充电器","电脑手机数码-数码配件-电池/充电器"],
      ["手机数码-闪光灯","电脑手机数码-数码摄像-闪光灯"],
      ["手机数码-存储设备","电脑手机数码-数码配件-存储卡"],
      ["手机数码-摄影包","电脑手机数码-数码配件-数码包"],
      ["手机数码-清洁用品","电脑手机数码-数码配件-相机清洁"],
      ["手机数码-三脚架/云台","电脑手机数码-数码配件-三角架/云台"],

      ["手机数码-MP3/MP4","电脑手机数码-时尚影音-MP3/MP4"],
      ["手机数码-电子书","电脑手机数码-时尚影音-电子书"],
      ["手机数码-录音笔","电脑手机数码-时尚影音-录音笔"],
      ["手机数码-手持电视","电脑手机数码-时尚影音-MID移动互联网终端"],
      ["手机数码-MP3/MP4配件","电脑手机数码-时尚影音-MP3/MP4附件"],

      ["电脑、办公-笔记本电脑","电脑手机数码-电脑整机-笔记本"],
      ["电脑、办公-上网本","电脑手机数码-电脑整机-上网本"],
      ["电脑、办公-平板电脑","电脑手机数码-电脑整机-平板电脑"],
      ["电脑、办公-台式机","电脑手机数码-电脑整机-台式机"],
      ["电脑、办公-笔记本配件","电脑手机数码-电脑整机-笔记本配件"],
      ["电脑、办公-iPad配件","电脑手机数码-时尚影音-ipad配件"],

      ["电脑、办公-鼠标","电脑手机数码-电脑外设产品-鼠标"],
      ["电脑、办公-键盘","电脑手机数码-电脑外设产品-键盘"],
      ["电脑、办公-U盘","电脑手机数码-电脑外设产品-U盘"],
      ["电脑、办公-移动硬盘","家电/办公-办公设备-移动硬盘"],
      ["电脑、办公-耳机/耳麦","电脑手机数码-电脑外设产品-耳机/耳麦"],
      ["电脑、办公-防护及清洁","电脑手机数码-电脑外设产品-电脑清洁"],
      ["电脑、办公-游戏设备","电脑手机数码-电脑外设产品-游戏设备"],

      ["电脑、办公-打印机","家电/办公-办公设备-打印机"],
      ["电脑、办公-一体机","家电/办公-办公设备-一体机"],
      ["电脑、办公-传真机","家电/办公-办公设备-传真机"],
      ["电脑、办公-扫描仪","家电/办公-办公设备-扫描仪"],
      ["电脑、办公-投影机","家电/办公-办公设备-投影机"],
      ["电脑、办公-复合机","家电/办公-办公设备-复合机"],
      ["电脑、办公-电子白板","家电/办公-办公设备-其他办公用品"],

      ["运动户外-冲锋衣/裤","运动户外-运动名品-运动服装"],
      ["运动户外-抓绒衣/裤","运动户外-运动名品-运动服装"],
      ["运动户外-速干衣/裤","运动户外-运动名品-运动服装"],
      ["运动户外-帽子/围巾/围脖/头巾","运动户外-运动名品-运动服装"],

      ["运动户外-登山鞋","运动户外-运动名品-运动鞋"],
      ["运动户外-户外休闲鞋","运动户外-运动名品-运动鞋"],
      ["运动户外-沙滩鞋/拖鞋","运动户外-运动名品-运动鞋"],
      ["运动户外-袜子","运动户外-运动名品-运动鞋"],

      ["运动户外-登山包/双肩包","运动户外-户外装备-户外背包"],
      ["运动户外-户外功能包","运动户外-户外装备-户外背包"],
      ["运动户外-腰包/挂包/臂包","运动户外-户外装备-户外背包"],

      ["运动户外-帐篷","运动户外-户外装备-帐篷"],
      ["运动户外-睡袋","运动户外-户外装备-睡袋"],
      ["运动户外-地席/垫子","运动户外-户外装备-户外垫子"],
      ["运动户外-户外工具","运动户外-户外装备-刀具/工具"],
      ["运动户外-折叠桌椅床","运动户外-户外装备-便携桌椅床"],
      ["运动户外-户外水具","运动户外-户外装备-垂钓用品"],
      ["运动户外-炊具/烧烤用品","运动户外-户外装备-烧烤用品"],
      ["运动户外-户外照明","运动户外-户外装备-户外照明"],

      ["运动户外-泳衣","运动户外-户外装备-泳衣"],

      ["运动户外-泳具/水上用品","运动户外-户外装备-泳镜/泳帽"],
      ["运动户外-瑜伽/形体锻炼","运动户外-运动名品-瑜珈用品"],
      ["运动户外-运动功能包","运动户外-运动名品-运动包"],

      ["汽车用品-GPS导航","汽车用品-导航通讯-GPS导航"],
      ["汽车用品-车载MP3/MP4","电脑手机数码-时尚影音-车载MP3"],

      ["汽车用品-车载吸尘器","汽车用品-汽车电器-车用吸尘器"],
      ["汽车用品-车载打气泵","汽车用品-汽车电器-打气泵"],
      ["汽车用品-电源转换器","汽车用品-导航通讯-车载电源"],
      ["汽车用品-车载手机充电器","电脑手机数码-手机配件-车载手机配件"],
      ["汽车用品-车载冰箱","汽车用品-汽车电器-车载冰箱"],
      ["汽车用品-车载电热水杯","汽车用品-汽车电器-其他"],
      ["汽车用品-车载加湿器","汽车用品-汽车电器-其他"],
      ["汽车用品-车载净化器","汽车用品-汽车电器-其他"],

      ["汽车用品-车蜡","汽车用品-养护用品-车蜡"],
      ["汽车用品-清洗护理剂","汽车用品-养护用品-其他"],
      ["汽车用品-擦车巾","汽车用品-养护用品-其他"],
      ["汽车用品-美容工具","汽车用品-养护用品-其他"],
      ["汽车用品-机油/防冻液","汽车用品-养护用品-其他"],
      ["汽车用品-燃油添加剂","汽车用品-养护用品-其他"],
      ["汽车用品-洗车机","汽车用品-养护用品-其他"],
      ["汽车用品-掸子","汽车用品-养护用品-其他"],

      ["汽车用品-方向盘锁","汽车用品-安全防盗-其他"],
      ["汽车用品-应急工具","汽车用品-安全防盗-急救包"],
      ["汽车用品-儿童安全座椅","汽车用品-安全防盗-儿童座椅"],

      ["汽车用品-汽车坐垫","汽车用品-车内饰品-座套/座垫"],
      ["汽车用品-汽车脚垫","汽车用品-车内饰品-脚垫"],
      ["汽车用品-颈枕/腰靠","汽车用品-车内饰品-头枕/颈枕"],
      ["汽车用品-收纳箱/置物桶","汽车用品-车内饰品-其他"],
      ["汽车用品-遮阳板/CD袋","汽车用品-导航通讯-其他"],
      ["汽车用品-护套三件套","汽车用品-导航通讯-其他"],
      ["汽车用品-方向盘套","汽车用品-车内饰品-方向盘套"],
      ["汽车用品-安全带护套","汽车用品-车内饰品-各类物品套"],
      ["汽车用品-指南针/温度计","汽车用品-车内饰品-其他"],
      ["汽车用品-钥匙扣","汽车用品-车内饰品-其他"],
      ["汽车用品-纸巾盒","汽车用品-车内饰品-其他"],
      ["汽车用品-饮料架/椅背袋","汽车用品-车内饰品-其他"],
      ["汽车用品-防滑垫","汽车用品-车内饰品-其他"],
      ["汽车用品-手机架","汽车用品-车内饰品-其他"],
      ["汽车用品-其他内饰物件","汽车用品-车内饰品-其他"],

      ["汽车用品-汽车香水","汽车用品-车内用品-空气净化"],
      ["汽车用品-空气清新剂","汽车用品-车内用品-空气净化"],
      ["汽车用品-车内异味祛除","汽车用品-车内用品-空气净化"],

      ["汽车用品-车衣","汽车用品-汽车电器-其他"],
      ["汽车用品-倒车辅助镜","汽车用品-汽车电器-其他"],
      ["汽车用品-车贴","汽车用品-汽车电器-其他"],
      ["汽车用品-装饰天线","汽车用品-汽车电器-其他"],

      ["汽车用品-雨刷","汽车用品-汽车电器-其他"],
      #["配件-雨刷","汽车用品-汽车电器-其他"],

      ["精品家居-床上用品","家居家纺-家纺-床品件套"],
      ["精品家居-桌布/桌旗/餐垫","家居家纺-家纺-罩/垫/套"],
      ["精品家居-枕芯","家居家纺-家纺-枕芯枕套"],
      ["精品家居-抱枕/靠枕/坐垫","家居家纺-家纺-抱枕坐垫"],

      ["精品家居-厨房餐具","家居家纺-厨房用具-厨具用品"],

      ["精品家居-收纳整理","家居家纺-清洁用品-清洁工具"],

      ["精品家居-装饰画","家居家纺-生活日用-家装软饰"],
      ["精品家居-钟表","家居家纺-生活日用-家装软饰"],
      ["精品家居-创意小件","家居家纺-生活日用-家装软饰"],

      ["玩具、礼品-创意电器","家居家纺-宠物用品-日用品玩具"],

      ["玩具、礼品-益智","母婴-玩具-益智类"],
      ["玩具、礼品-遥控电动","母婴-玩具-遥控玩具"],
      ["玩具、礼品-模型","母婴-玩具-模型玩具"],
      ["玩具、礼品-毛绒公仔","母婴-玩具-毛绒玩具"],
      ["玩具、礼品-幼教用品","母婴-玩具-儿童玩具"],

      ["玩具、礼品-商务礼品","珠宝配饰-时尚礼品-商务礼品"],
      ["玩具、礼品-节庆礼品","珠宝配饰-时尚礼品-其他礼品"],
      ["玩具、礼品-珠宝首饰","珠宝配饰-时尚礼品-其他礼品"],

      ["玩具、礼品-健康用品","珠宝配饰-时尚礼品-其他礼品"]

    ]


    
    def title
      doc.css("#productname/h1/strong").text
    end

    def price
    end

    def price_url
      doc.css("#itemimg").last["src"]
    end

    def stock
      return 1 if doc.css("#kcdesc").text =~ /发货/
      return 0 if doc.css("#kcdesc").text =~ /售完/
      logger.info("stock issue!")
      0
    end

    # 商品代码
    def product_code
      doc.css("div.infos dl.properties:first dd:first").text
    end

    def image_url
      doc.css("div.pPreview img").first["src"]
    end

    def score
      doc.css("span.pScore em").first["style"].gsub(/[\D]+/, "").to_i/20
    end

    def standard
     # doc.css("div#F2 table").to_html
    end

    def comments
      #http://club.360buy.com/clubservice/productcomment-495087-5-0.+html
      []
    end

    def end_product
      route_str = product.page.category.ancestors_and_self.map do |cate|
        cate.name
      end.join("-")
      puts route_str
      origin_base_map(CATEGORY_MAP,route_str)
    end

    def merchant
      get_merchant("库巴购物网")

    end

    def brand
      
     # if MOBILE_DIGITAL_LIST.include?(product.page.category.name)

     #   name_str = doc.css(".crumb > a")[4].content
     #   BRAND_LIST.map do |brand|
     #     if name_str.index(brand)==0  
     #       name_str = brand
    #      end
    #    end

   #     name_str = name_str.gsub(/\//,"\\/").gsub("）"," ").gsub("（"," ").gsub("("," ").gsub(")"," ")

    #    if name_str.index("...")
    #      name_str = ""
    #    end

    #    if name_str != ""
    #      brandobj = Brand.where(:name => /^(.*?)(#{name_str})/i).first
    #      if brandobj.nil?
    #        brand = Brand.create(:name =>name_str)
   #      else
    #        brand = brandobj
    #      end
     #   end
    #  end
   #   brand
    end

    def brand_type
     # if MOBILE_DIGITAL_LIST.include?(product.page.category.name)
     #   if doc.css(".crumb > a")[5].nil?
     #     name_str = ""
     #   else
     #     name_str = doc.css(".crumb > a")[5].content
     #   end

     #   name_str = name_str.gsub(/\//,"\\/").gsub("）"," ").gsub("（"," ").gsub("("," ").gsub(")"," ")
     #   if name_str.index("...")
     #     name_str = ""
     #   end

     #   if name_str != ""
     #     brandtypeobj = BrandType.where(:name => /^(.*?)(#{name_str})/i).first
      #    if brandtypeobj.nil?
     #       brand_type = BrandType.create(:name =>name_str,:brand=>brand)
     #     else
     #       brand_type = brandtypeobj
     #     end
     #   end
     # end
     # brand_type
    end
    
    def belongs_to_categories

      doc.css(".crumb a").select{|elem| elem["href"] != "http://www.coo8.com"}[0,2].map do |elem|
        {
          :name => elem.inner_text,
          :url  => elem["href"]
        }
      end
    end
    
    def desc
      
    end

    def get_union_url
      product.url
    end

    def get_order_num
      route_str = product.page.category.ancestors_and_self.map do |cate|
        cate.name
      end.join("-")

      order_num_end_product = origin_base_map(CATEGORY_MAP,route_str)

      if order_num_end_product.nil?
        10000000
      else
        order_num_end_product.order_num
      end

    end
  end
end
