#encoding: utf-8
require 'nokogiri'

module Spider
  class OnecarParser < Parser
    CATEGORY_MAP = [
["车内功能与装饰-安全带护肩", "汽车用品-车内饰品-摆件/挂饰"],
["车内功能与装饰-安全带舒适夹", "汽车用品-车内饰品-摆件/挂饰"],
["车内功能与装饰-车挂及吊饰", "汽车用品-车内饰品-摆件/挂饰"],
["车内功能与装饰-车用垃圾桶", "汽车用品-车内用品-置物架"],
["车内功能与装饰-车用衣架挂钩", "汽车用品-车内用品-置物架"],
["车内功能与装饰-方向盘套", "汽车用品-车内饰品-方向盘套"],
["车内功能与装饰-扶手箱", "汽车用品-车内用品-其他"],
["车内功能与装饰-后备箱衬垫", "汽车用品-车内饰品-座套/座垫 "],
["车内功能与装饰-后视镜广角镜", "汽车用品-车内用品-其他"],
["车内功能与装饰-后视镜套", "汽车用品-车内饰品-各类物品套"],
["车内功能与装饰-米其林", "汽车用品-车内饰品-其他"],
["车内功能与装饰-排挡装饰", "汽车用品-车内饰品-其他"],
["车内功能与装饰-时钟指南球", "汽车用品-车内饰品-卡通饰品"],
["车内功能与装饰-收纳袋", "汽车用品-车内用品-其他"],
["车内功能与装饰-手机饮料架", "汽车用品-车内用品-置物架"],
["车内功能与装饰-司机眼镜", "汽车用品-车内用品-其他"],
["车内功能与装饰-太阳挡", "汽车用品-车内饰品-遮阳挡窗帘"],
["车内功能与装饰-头枕颈枕", "汽车用品-车内饰品-头枕/颈枕"],
["车内功能与装饰-温湿度计", "汽车用品-车内用品-其他"],
["车内功能与装饰-烟灰缸", "汽车用品-车内用品-其他"],
["车内功能与装饰-眼镜票据夹", "汽车用品-车内用品-其他"],
["车内功能与装饰-腰靠抱枕", "家居家纺-家纺-抱枕坐垫"],
["车内功能与装饰-仪表台装饰", "汽车用品-车内饰品-摆件/挂饰"],
["车内功能与装饰-椅垫座垫", "汽车用品-车内饰品-座套/座垫 "],
["车内功能与装饰-迎宾踏板", "汽车用品-车内饰品-其他"],
["车内功能与装饰-雨伞袋", "汽车用品-车内用品-其他"],
["车内功能与装饰-钥匙扣", "汽车用品-车内用品-钥匙扣/包"],
["车内功能与装饰-遮阳板收纳", "汽车用品-车内用品-其他"],
["车内功能与装饰-遮雨挡", "汽车用品-车内用品-其他"],
["车内功能与装饰-止滑垫", "汽车用品-车内用品-其他"],
["车内功能与装饰-纸巾盒袋", "汽车用品-车内用品-其他"],
["车内功能与装饰-置物筒盒", "汽车用品-车内用品-置物架"],
["车内功能与装饰-助力球", "汽车用品-车内用品-其他"],
["车外功能与装饰-车标车徽天线", "汽车用品-车内用品-其他"],
["车外功能与装饰-车窗隔热防爆膜", "汽车用品-车内用品-其他"],
["车外功能与装饰-车身车门防撞", "汽车用品-车内用品-其他"],
["车外功能与装饰-车身随意贴", "汽车用品-车内用品-其他"],
["车外功能与装饰-车衣车漆防护", "汽车用品-车内用品-其他"],
["车外功能与装饰-车用牌照框", "汽车用品-车内用品-其他"],
["车外功能与装饰-挡泥板", "汽车用品-车内用品-其他"],
["车外功能与装饰-防眩蓝镜", "汽车用品-车内用品-其他"],
["车外功能与装饰-金属字母贴", "汽车用品-车内用品-其他"],
["车外功能与装饰-门碗保护", "汽车用品-车内用品-其他"],
["车外功能与装饰-气门嘴装饰", "汽车用品-车内用品-其他"],
["车外功能与装饰-油箱装饰盖", "汽车用品-车内用品-其他"],
["车外功能与装饰-雨刷雨刮", "汽车用品-车内用品-其他"],
["车外功能与装饰-遮雨挡", "汽车用品-车内用品-其他"],
["车用电器系列-贝尔金系列", "汽车用品-汽车电器-其他"],
["车用电器系列-车内空气治理", "汽车用品-车内用品-空气净化"],
["车用电器系列-车用咖啡壶", "汽车用品-汽车电器-其他"],
["车用电器系列-倒车雷达", "汽车用品-导航通讯-倒车雷达"],
["车用电器系列-电源分配器", "汽车用品-汽车电器-其他"],
["车用电器系列-防静电", "汽车用品-汽车电器-其他"],
["车用电器系列-辅助功能灯光", "汽车用品-汽车电器-其他"],
["车用电器系列-蓝牙车载免提", "汽车用品-导航通讯-车载蓝牙"],
["车用电器系列-逆变电源", "汽车用品-汽车电器-逆变器"],
["车用电器系列-汽车冰箱", "汽车用品-汽车电器-车载冰箱"],
["车用电器系列-汽车大灯", "汽车用品-汽车电器-其他"],
["车用电器系列-汽车装饰灯光", "汽车用品-汽车电器-其他"],
["车用电器系列-卫星导航", "汽车用品-导航通讯-GPS导航"],
["车用电器系列-吸尘打气胎压", "汽车用品-汽车电器-车用吸尘器"],
["车用电器系列-音源转换", "汽车用品-汽车电器-其他"],
["车用香氛系列-车内空气治理", "汽车用品-车内用品-空气净化"],
["车用香氛系列-出风口香座", "汽车用品-车内用品-空气净化"],
["车用香氛系列-典雅香水座", "汽车用品-车内用品-空气净化"],
["车用香氛系列-卡通香水座", "汽车用品-车内用品-空气净化"],
["车用香氛系列-水晶香水座", "汽车用品-车内用品-空气净化"],
["车用香氛系列-香水挂件", "汽车用品-车内饰品-摆件/挂饰"],
["车用香氛系列-香味替换装", "汽车用品-车内用品-空气净化"],
["车用椅套脚垫-车型专用脚垫", "汽车用品-车内饰品-脚垫"],
["车用椅套脚垫-车型专用椅套", "汽车用品-车内饰品-各类物品套"],
["车用椅套脚垫-订做脚垫", "汽车用品-车内饰品-脚垫"],
["车用椅套脚垫-订做椅套", "汽车用品-车内饰品-各类物品套"],
["车用椅套脚垫-通用脚垫", "汽车用品-车内饰品-脚垫"],
["车用椅套脚垫-通用椅套", "汽车用品-车内饰品-各类物品套"],
["车用椅套脚垫-夏季凉垫", "汽车用品-车内饰品-座套/座垫 "],
["车用椅套脚垫-椅垫座垫", "汽车用品-车内饰品-座套/座垫 "],
["户外休闲系列-餐具炉具", "运动户外-户外装备-野餐炊具"],
["户外休闲系列-户外灯具", "运动户外-户外装备-户外照明"],
["户外休闲系列-绳带应急", "运动户外-户外装备-登山攀岩"],
["户外休闲系列-水囊水壶", "家居家纺-厨房用具-水壶"],
["户外休闲系列-仪表快挂", "运动户外-户外装备-指南针等户外仪表"],
["户外休闲系列-帐篷地垫睡袋", "运动户外-户外装备-帐篷"],
["汽车配件及改装-避震缓冲器", "汽车用品-其他-其他"],
["汽车配件及改装-点火线", "汽车用品-其他-其他"],
["汽车配件及改装-动力提升", "汽车用品-其他-其他"],
["汽车配件及改装-火花塞", "汽车用品-其他-其他"],
["汽车配件及改装-燃油添加", "汽车用品-其他-其他"],
["汽车配件及改装-三滤", "汽车用品-其他-其他"],
["汽车配件及改装-刹车片", "汽车用品-其他-其他"],
["汽车配件及改装-尾管尾喉", "汽车用品-其他-其他"],
["汽车清洁及护理-补漆笔补漆喷罐", "汽车用品-养护用品-漆面修补"],
["汽车清洁及护理-车蜡车釉", "汽车用品-养护用品-车蜡"],
["汽车清洁及护理-挡泥板", "汽车用品-养护用品-其他"],
["汽车清洁及护理-汽车清洁护理", "汽车用品-养护用品-洗车打蜡"],
["汽车清洁及护理-养护工具", "汽车用品-养护用品-蜡扫/掸子"],
["应急安全防盗-车用防盗器", "汽车用品-安全防盗-防盗器"],
["应急安全防盗-儿童安全椅", "汽车用品-安全防盗-儿童座椅"],
["应急安全防盗-应急车用", "汽车用品-安全防盗-其他"]
]
 
    BASE_URL = "http://www.1car.com.cn"
		def belongs_to_categories
		  []
		end

    def title
      doc.css("table.tabletopbackground td b").text.strip
	end

    def price
	  doc.css("tr.tablewhite li font.textred").text[/\d+\.\d+/].to_f
	end

  	def stock
		  return 1 
  	end

  	def image_url
		  File.join(BASE_URL, doc.css("a.zoomlink img").first["src"])
		end

		def desc
		end

		def price_url

		end

		def score
		  doc.css("a.tablewhite").select{|elem| elem.text.include?("星级")}.first.text[/\d+\.\d+/].to_f 
		end

		def product_code
		  doc.css("li").select{|elem| elem.text.include?("编号")}.first.text[/\d+/]
		end

		def standard

		end
		


		def comments
		  comments = doc.css("table.map-t-b-head1 table.tablewhite")
		  content_elems = doc.css("#disCussListShow .tgr label")
		  publish_at_elems =  doc.css("#disCussListShow .clear s")
		 (1..comments.length).map do |index|
		   {
				publish_at: comments[index-1].css("tr:first td:eq(3)").text,
				content: content_elems[index-1].css("tr:eq(2) td:eq(2)").text
			}
		  end	
		end

		def end_product
      route_str = product.page.category.ancestors_and_self.map do |cate|
        cate.name
      end.join("-")
      puts route_str
      origin_base_map(CATEGORY_MAP,route_str)
		end

		def merchant
                #  return Merchant.find(BSON::ObjectId("4e53c0aa1d41c862fc00057e"))
		end

		def brand
		#  doc.css("div.brandArea span strong a").inner_text
		end

		def brand_type
		end

    def get_order_num
      route_str = product.page.category.ancestors_and_self.map do |cate|
        cate.name
      end.join("-")

      order_num_end_product = origin_base_map(CATEGORY_MAP,route_str)

      if order_num_end_product.nil?
        10000000
      else
        order_num_end_product.order_num
      end

    end

    def get_union_url
    end
	end
end

