# encoding: utf-8
require 'nokogiri'

module Spider
  class OrangeParser < Parser
     CATEGORY_MAP = [ 
 ["电脑数码-电脑-平板电脑", "电脑手机数码-电脑整机-平板电脑"],
 ["电脑数码-电脑-电脑一体机", "电脑手机数码-电脑整机-台式机"],
 ["电脑数码-电脑-上网本", "电脑手机数码-电脑整机-上网本"],
 ["电脑数码-电脑-笔记本电脑", "电脑手机数码-电脑整机-笔记本"],
 ["电脑数码-数码摄录-数码相机", "电脑手机数码-数码摄像-数码相机"],
 ["电脑数码-数码摄录-数码摄像机", "电脑手机数码-数码摄像-数码摄像机"],
 ["电脑数码-数码配件-摄像头", "电脑手机数码-数码摄像-单反镜头"],
 ["电脑数码-数码配件-托架", "电脑手机数码-数码配件-三角架/云台"],
 ["电脑数码-数码配件-集线器", "电脑手机数码-数码配件-其他"],
 ["电脑数码-数码配件-音箱", "电脑手机数码-时尚影音-音箱"],
 ["电脑数码-数码配件-鼠标", "电脑手机数码-电脑外设产品-鼠标"],
 ["电脑数码-数码配件-显示器", "电脑手机数码-电脑外设产品-显示器"],
 ["电脑数码-数码配件-耳机/耳麦", "电脑手机数码-电脑外设产品-耳机/耳麦"],
 ["电脑数码-数码配件-屏贴", "电脑手机数码-数码配件-数码贴膜"],
 ["电脑数码-数码配件-键盘保护膜", "电脑手机数码-电脑外设产品-其它电脑附件"],
 ["电脑数码-数码配件-手垫贴", "电脑手机数码-电脑外设产品-鼠标垫"],
 ["电脑数码-数码配件-触控贴", "电脑手机数码-数码配件-其他"],
 ["电脑数码-数码配件-鼠标保护贴", "电脑手机数码-数码配件-数码贴膜"],
 ["电脑数码-数码配件-擦屏套", "电脑手机数码-电脑网络产品-其它网络设备"],
 ["电脑数码-数码配件-屏幕保护垫", "电脑手机数码-电脑网络产品-其它网络设备"],
 ["电脑数码-数码配件-电脑保护套", "电脑手机数码-电脑网络产品-其它网络设备"],
 ["电脑数码-数码配件-存储卡", "电脑手机数码-数码配件-存储卡"],
 ["电脑数码-数码配件-读卡器", "电脑手机数码-数码配件-读卡器"],
 ["电脑数码-数码配件-键盘", "电脑手机数码-电脑外设产品-键盘"],
 ["电脑数码-数码配件-散热器", "电脑手机数码-电脑配件-散热器"],
 ["电脑数码-数码配件-转接线", "电脑手机数码-电脑外设产品-插座/插线板"],
 ["电脑数码-数码配件-连接线", "电脑手机数码-电脑外设产品-插座/插线板"],
 ["电脑数码-数码周边-U盘", "电脑手机数码-电脑外设产品-U盘"],
 ["电脑数码-数码周边-多媒体播放盒", "电脑手机数码-电脑外设产品-外置盒"],
 ["电脑数码-数码周边-U盘播放器", "电脑手机数码-电脑网络产品-其它网络设备"],
 ["电脑数码-数码周边-益智玩具", "电脑手机数码-电脑网络产品-其它网络设备"],
 ["电脑数码-数码周边-电子狗", "电脑手机数码-电脑网络产品-其它网络设备"],
 ["电脑数码-数码周边-动力舱", "电脑手机数码-电脑网络产品-其它网络设备"],
 ["电脑数码-数码周边-游戏设备", "电脑手机数码-电脑外设产品-游戏设备"],
 ["电脑数码-数码周边-电子教育", "电脑手机数码-时尚影音-点读笔/点读机"],
 ["电脑数码-数码周边-电子书", "电脑手机数码-时尚影音-点读笔/点读机"],
 ["电脑数码-数码周边-移动硬盘", "电脑手机数码-电脑外设产品-移动硬盘"],
 ["电脑数码-数码周边-录音笔", "电脑手机数码-时尚影音-录音笔"],
 ["电脑数码-数码周边-电子词典", "电脑手机数码-时尚影音-电子词典"],
 ["电脑数码-数码周边-网络终端", "电脑手机数码-时尚影音-MID移动互联网终端"],
 ["电脑数码-数码周边-电子相框", "电脑手机数码-时尚影音-数码相框"],
 ["移动通讯-手机", "电脑手机数码-手机通讯-普通手机"],
 ["移动通讯-手机配件-移动电源", "电脑手机数码-手机配件-手机电池"],
 ["移动通讯-手机配件-蓝牙耳机", "电脑手机数码-手机配件-蓝牙耳机"],
 ["移动通讯-手机配件-手机耳机", "电脑手机数码-手机配件-手机耳机"],
 ["移动通讯-手机配件-手机保护套", "电脑手机数码-手机配件-手机保护套"],
 ["移动通讯-手机配件-手机充电器", "电脑手机数码-手机配件-手机充电器"],
 ["移动通讯-手机配件-手机手写笔", "电脑手机数码-手机配件-其它配件"],
 ["移动通讯-手机配件-手机其他配件", "电脑手机数码-手机配件-其它配件"],
 ["移动通讯-手机配件-手机电池", "电脑手机数码-手机配件-手机电池"],
 ["视听影音-液晶电视-3D电视", "家电/办公-生活家电-液晶电视"],
 ["视听影音-液晶电视-等离子电视", "家电/办公-生活家电-等离子电视"],
 ["视听影音-液晶电视-液晶电视附件", "家电/办公-生活家电-液晶电视"],
 ["视听影音-液晶电视-LED电视", "家电/办公-生活家电-液晶电视"],
 ["视听影音-液晶电视-LCD电视", "家电/办公-生活家电-液晶电视"],
 ["视听影音-便携影音-MP5", "电脑手机数码-时尚影音-高清播放器"],
 ["视听影音-便携影音-移动DVD", "家电/办公-生活家电-音响 DVD"],
 ["视听影音-便携影音-MP3", "电脑手机数码-时尚影音-MP3/MP4"],
 ["视听影音-便携影音-MP4", "电脑手机数码-时尚影音-MP3/MP4"],
 ["视听影音-便携影音-移动电视", "电脑手机数码-时尚影音-高清播放器"],
 ["视听影音-大音响-台式音响", "家电/办公-生活家电-音响 DVD"],
 ["视听影音-大音响-多媒体音响", "家电/办公-生活家电-音响 DVD"],
 ["家用电器-冰洗空调-冰箱", "家电/办公-生活家电-冰箱"],
 ["家用电器-冰洗空调-空调", "家电/办公-生活家电-空调"],
 ["家用电器-冰洗空调-洗衣机", "家电/办公-生活家电-洗衣机"],
 ["家用电器-冰洗空调-冰柜", "家电/办公-厨房家电-酒柜/冷柜"],
 ["家用电器-冰洗空调-冰吧", "家电/办公-厨房家电-酒柜/冷柜"],
 ["家用电器-卫浴家电-热水器", "家电/办公-生活家电-热水器"],
 ["家用电器-厨房电器-紫砂煲", "家电/办公-厨房家电-锅"],
 ["家用电器-厨房电器-洗碗机", "家电/办公-厨房家电-消毒柜/洗碗机"],
 ["家用电器-厨房电器-电火锅", "家电/办公-厨房家电-电饭煲"],
 ["家用电器-厨房电器-烤面包机", "家电/办公-厨房家电-电烤箱"],
 ["家用电器-厨房电器-三明治机", "家电/办公-厨房家电-电烤箱"],
 ["家用电器-厨房电器-咖啡机", "家电/办公-厨房家电-咖啡机"],
 ["家用电器-厨房电器-电蒸锅", "家电/办公-厨房家电-其他"],
 ["家用电器-厨房电器-电压力锅", "家电/办公-厨房家电-电压力锅"],
 ["家用电器-厨房电器-电蒸/炖锅", "家电/办公-厨房家电-其他"],
 ["家用电器-厨房电器-电饼铛/煎烤机", "家电/办公-厨房家电-其他"],
 ["家用电器-厨房电器-搅拌机", "家电/办公-厨房家电-其他"],
 ["家用电器-厨房电器-电饭盒", "家电/办公-厨房家电-其他"],
 ["家用电器-厨房电器-电煮锅", "家电/办公-厨房家电-锅"],
 ["家用电器-厨房电器-炒锅", "家电/办公-厨房家电-锅"],
 ["家用电器-厨房电器-微波炉", "家电/办公-厨房家电-微波炉"],
 ["家用电器-厨房电器-电磁炉", "家电/办公-厨房家电-电磁炉"],
 ["家用电器-厨房电器-消毒碗柜", "家电/办公-厨房家电-消毒柜/洗碗机"],
 ["家用电器-厨房电器-灶具", "家电/办公-厨房家电-燃气灶"],
 ["家用电器-厨房电器-吸油烟机", "家电/办公-厨房家电-净化器"],
 ["家用电器-厨房电器-烤箱", "家电/办公-厨房家电-电烤箱"],
 ["家用电器-厨房电器-电饭煲", "家电/办公-厨房家电-电饭煲"],
 ["家用电器-生活家电-除湿/干衣机", "家电/办公-生活家电-加湿器"],
 ["家用电器-生活家电-纯水机", "家电/办公-厨房家电-饮水机"],
 ["家用电器-生活家电-取暖电器", "家电/办公-生活家电-家电配件"],
 ["家用电器-生活家电-空调扇", "家电/办公-小家电-排气扇"],
 ["家用电器-生活家电-饮水机", "家电/办公-厨房家电-饮水机"],
 ["家用电器-生活家电-榨汁机", "家电/办公-厨房家电-榨汁机"],
 ["家用电器-生活家电-酸奶机", "家电/办公-厨房家电-酸奶机"],
 ["家用电器-生活家电-开水煲", "家电/办公-厨房家电-电水壶"],
 ["家用电器-生活家电-台灯", "家电/办公-小家电-其他"],
 ["家用电器-生活家电-挂烫机", "家电/办公-小家电-其他"],
 ["家用电器-生活家电-加湿器", "家电/办公-小家电-其他"],
 ["家用电器-生活家电-电风扇", "家电/办公-生活家电-电风扇"],
 ["家用电器-生活家电-电子秤", "家居家纺-生活日用-健康秤"],
 ["家用电器-生活家电-吸尘器", "家电/办公-生活家电-吸尘器"],
 ["家用电器-生活家电-净化器", "家居家纺-生活日用-净化防潮"],
 ["家用电器-生活家电-果蔬机", "家电/办公-生活家电-家电配件"],
 ["家用电器-生活家电-煮蛋器", "家电/办公-厨房家电-煮蛋器"],
 ["家用电器-生活家电-电水壶", "家电/办公-厨房家电-电水壶"],
 ["家用电器-生活家电-料理机", "家电/办公-厨房家电-其他"],
 ["家用电器-生活家电-豆浆机", "家电/办公-厨房家电-豆浆机"],
 ["家用电器-生活家电-果汁机", "家电/办公-厨房家电-榨汁机"],
 ["家用电器-美体护理-美发直发器", "家电/办公-小家电-其他"],
 ["家用电器-美体护理-按摩器", "家电/办公-小家电-按摩器"],
 ["家用电器-美体护理-家庭护理", "家电/办公-小家电-其他"],
 ["家用电器-美体护理-脱毛器", "家电/办公-小家电-脱毛器"],
 ["家用电器-美体护理-电动牙刷", "家电/办公-小家电-电动牙刷"],
 ["家用电器-美体护理-剃须刀", "家电/办公-小家电-剃须刀"],
 ["家用电器-美体护理-电吹风", "家电/办公-小家电-电吹风"],
 ["家用电器-美体护理-电熨斗", "家电/办公-小家电-熨斗"],
 ["家用电器-美体护理-睫毛卷翘器", "家电/办公-小家电-其他"],
 ["家用电器-美体护理-指甲修剪器", "家电/办公-小家电-其他"],
 ["家用电器-美体护理-毛孔清洁器", "家电/办公-小家电-其他"]
]
    def title
      doc.css("h1.goodsname").text
    end

    def price
      doc.css("span.price1/text()").text.sub("￥", "").to_i
    end

    def price_url
    end

    def stock
      if doc.search("div.buyinfo table td").last.text =~ /有货/
        return 1 
      else
        return 0
      end
    end

    def image_url
      doc.css("div.goods-detail-pic img").first["src"]
    end

    def score
      1
    end

    def desc
    end

    def standard
    end

    def comments
      content_elems    = doc.css("div.division span.commentText")
      publish_at_elems = doc.css("div.division span.timestamp")
      (0..content_elems.count-1).map do |i|
        {
          :publish_at => publish_at_elems[i].inner_text,
          :content => content_elems[i].inner_text,

        }
      end
    end

    def end_product
      route_str = product.page.category.ancestors_and_self.map do |cate|
        cate.name
      end.join("-")
      puts route_str
      origin_base_map(CATEGORY_MAP,route_str)
    end

    def merchant
      get_merchant("品橙网")

    end

    def brand
    end

    def brand_type
    end
    
    def product_code
      doc.css("ul.goodsprops li:first").text.scan(/\d+/).last
    end
    
    def belongs_to_categories
      doc.css(".nav_p a").select{|elem| elem["href"] =~ /gallery/}.map do |elem|
        {
          :name => elem.inner_text,
          :url  => elem["href"]
        }
      end
    end

    def get_union_url
      htmlstr = product.url.split("/").last
      product.url.sub(/#{htmlstr}/, "?product-#{htmlstr}#r-61-435870-121-m")

    end

    def get_order_num
      route_str = product.page.category.ancestors_and_self.map do |cate|
        cate.name
      end.join("-")

      order_num_end_product = origin_base_map(CATEGORY_MAP,route_str)

      if order_num_end_product.nil?
        10000000
      else
        order_num_end_product.order_num
      end

    end
    
  end
end
