# encoding: utf-8
require 'nokogiri'

module Spider
	class RedbabyParser < Parser
    CATEGORY_MAP = [
      ["孕妈专区-孕妇服饰-服装", "母婴-妈妈专区-孕妇装"],
      ["孕妈专区-孕妇服饰-配饰", "母婴-妈妈专区-孕妇装"],
      ["孕妈专区-孕妇服饰-妈妈金饰", "母婴-妈妈专区-孕妇装"],
      ["孕妈专区-妈妈内衣-孕妇内衣套装", "母婴-妈妈专区-孕妇装"],
      ["孕妈专区-妈妈内衣-孕妇内衣/内裤", "母婴-妈妈专区-孕妇装"],
      ["孕妈专区-妈妈内衣-妈妈托腹", "母婴-妈妈专区-孕妇装"],
      ["孕妈专区-产后修复-束腹裤/带", "母婴-妈妈专区-恢复瘦身"],
      ["孕妈专区-产后修复-妊娠纹/疤痕修复", "母婴-妈妈专区-恢复瘦身"],
      ["孕妈专区-产后修复-产后恢复塑身衣", "母婴-妈妈专区-恢复瘦身"],
      ["孕妈专区-防辐射-防辐射服", "母婴-妈妈专区-防辐射服"],
      ["孕妈专区-防辐射-防辐射眼镜", "母婴-妈妈专区-防辐射服"],
      ["孕妈专区-孕产营养品/奶粉-妈妈营养品", "母婴-妈妈专区-孕妇奶粉"],
      ["孕妈专区-孕产营养品/奶粉-妈妈奶粉", "母婴-妈妈专区-孕妇奶粉"],
      ["孕妈专区-孕产读物-育儿", "母婴-益智早教-早教书籍"],
      ["孕妈专区-孕产读物-孕产妇保健", "母婴-益智早教-早教书籍"],
      ["孕妈专区-孕产读物-胎教", "母婴-益智早教-早教书籍"],
      ["孕妈专区-妈妈个人护理-卫生巾", "母婴-妈妈专区-个人护理"],
      ["孕妈专区-妈妈个人护理-面部护理", "母婴-妈妈专区-个人护理"],
      ["孕妈专区-妈妈个人护理-身体护理", "母婴-妈妈专区-个人护理"],
      ["孕妈专区-妈妈个人护理-洁牙护齿", "母婴-妈妈专区-个人护理"],
      ["孕妈专区-妈妈个人护理-眼部护理", "母婴-妈妈专区-个人护理"],
      ["孕妈专区-妈妈个人护理-产褥/护理垫", "母婴-妈妈专区-个人护理"],
      ["孕妈专区-妈妈个人护理-洗涤清洁", "母婴-妈妈专区-个人护理"],
      ["孕妈专区-妈妈个人护理-女性湿巾/洗液", "母婴-妈妈专区-个人护理"],
      ["孕妈专区-母乳喂养用品-吸乳器", "母婴-日用品-吸乳器"],
      ["孕妈专区-母乳喂养用品-母乳储存器", "母婴-日用品-吸乳器"],
      ["孕妈专区-母乳喂养用品-乳垫", "母婴-日用品-孕婴清洁护肤"],
      ["孕妈专区-母乳喂养用品-乳头保护", "母婴-日用品-孕婴清洁护肤"],
      ["孕妈专区-母乳喂养用品-哺乳衣/文胸", "母婴-日用品-孕婴清洁护肤"],
      ["孕妈专区-胎心仪/孕妇枕-胎心仪", "母婴-妈妈专区-孕妇装"],
      ["孕妈专区-胎心仪/孕妇枕-孕妇枕", "母婴-妈妈专区-孕妇装"],
      ["孕妈专区-妈咪包-背婴带", "母婴-日用品-背带/妈咪包"],
      ["营养食品-奶粉-4段奶粉", "母婴-宝贝食品-四段奶粉"],
      ["营养食品-奶粉-3段奶粉", "母婴-宝贝食品-三段奶粉"],
      ["营养食品-奶粉-2段奶粉", "母婴-宝贝食品-二段奶粉"],
      ["营养食品-奶粉-1段奶粉", "母婴-宝贝食品-一段奶粉"],
      ["营养食品-奶粉-羊奶粉", "母婴-宝贝食品-羊奶粉"],
      ["营养食品-奶粉-妈妈奶", "母婴-妈妈专区-孕妇奶粉"],
      ["营养食品-奶粉-粉特殊配方奶粉", "母婴-宝贝食品-特殊配方奶粉"],
      ["营养食品-辅食-泥糊", "母婴-宝贝食品-米粉等辅食"],
      ["营养食品-辅食-面条类", "母婴-宝贝食品-米粉等辅食"],
      ["营养食品-辅食-冲调类", "母婴-宝贝食品-米粉等辅食"],
      ["营养食品-辅食-长牙期食品", "母婴-宝贝食品-米粉等辅食"],
      ["营养食品-辅食-肉松/肉酥", "母婴-宝贝食品-米粉等辅食"],
      ["营养食品-辅食-宝宝零食", "母婴-宝贝食品-米粉等辅食"],
      ["营养食品-辅食-果汁/水", "母婴-宝贝食品-米粉等辅食"],
      ["营养食品-婴幼儿营养品-益生菌", "母婴-保健营养-牛初乳类"],
      ["营养食品-婴幼儿营养品-鱼肝油", "母婴-保健营养-鱼油类"],
      ["营养食品-婴幼儿营养品-钙", "母婴-保健营养-钙铁锌"],
      ["营养食品-婴幼儿营养品-钙铁锌", "母婴-保健营养-钙铁锌"],
      ["营养食品-婴幼儿营养品-DHA", "母婴-保健营养-DHA"],
      ["营养食品-婴幼儿营养品-孕婴食用油", "母婴-保健营养-鱼油类"],
      ["营养食品-婴幼儿营养品-清火开胃", "母婴-保健营养-牛初乳类"],
      ["营养食品-婴幼儿营养品-维生素", "母婴-保健营养-牛初乳类"],
      ["营养食品-婴幼儿营养品-牛初乳", "母婴-保健营养-牛初乳类"],
      ["成长用品-喂养用品-食物调理器", "母婴-日用品-餐具"],
      ["成长用品-喂养用品-奶瓶", "母婴-日用品-奶瓶奶嘴"],
      ["成长用品-喂养用品-宝宝杯/壶", "母婴-日用品-餐具"],
      ["成长用品-喂养用品-奶嘴", "母婴-日用品-奶瓶奶嘴"],
      ["成长用品-喂养用品-餐具", "母婴-日用品-餐具"],
      ["成长用品-喂养用品-奶瓶刷/夹", "母婴-日用品-奶瓶奶嘴"],
      ["成长用品-喂养用品-牙胶", "母婴-日用品-奶瓶奶嘴"],
      ["成长用品-喂养用品-安抚奶嘴", "母婴-日用品-奶瓶奶嘴"],
      ["成长用品-婴幼儿洗浴护肤-护肤", "母婴-日用品-婴儿沐浴"],
      ["成长用品-婴幼儿洗浴护肤-婴儿皂", "母婴-日用品-婴儿沐浴"],
      ["成长用品-婴幼儿洗浴护肤-洗涤清洁", "母婴-日用品-婴儿沐浴"],
      ["成长用品-婴幼儿洗浴护肤-礼盒系列", "母婴-日用品-婴儿沐浴"],
      ["成长用品-婴幼儿洗浴护肤-护体系列", "母婴-日用品-婴儿沐浴"],
      ["成长用品-婴幼儿洗浴护肤-口腔鼻腔护理", "母婴-日用品-婴儿沐浴"],
      ["成长用品-婴幼儿洗浴护肤-洗发沐浴", "母婴-日用品-婴儿沐浴"],
      ["成长用品-尿裤/纸巾-湿巾", "母婴-日用品-纸尿裤"],
      ["成长用品-尿裤/纸巾-纸巾", "母婴-日用品-纸尿裤"],
      ["成长用品-尿裤/纸巾-婴幼儿纸尿裤", "母婴-日用品-纸尿裤"],
      ["成长用品-尿裤/纸巾-婴幼儿纸尿片", "母婴-日用品-纸尿裤"],
      ["成长用品-尿裤/纸巾-成人防尿", "母婴-日用品-纸尿裤"],
      ["成长用品-尿裤/纸巾-成长裤", "母婴-日用品-纸尿裤"],
      ["成长用品-尿裤/纸巾-婴幼儿布尿裤", "母婴-日用品-纸尿裤"],
      ["成长用品-尿裤/纸巾-尿垫巾/尿布", "母婴-日用品-纸尿裤"],
      ["成长用品-尿裤/纸巾-保温消毒", "母婴-日用品-纸尿裤"],
      ["成长用品-保温桶盒-消毒锅", "母婴-日用品-餐具"],
      ["成长用品-保温桶盒-暖奶器", "母婴-日用品-热奶器"],
      ["成长用品-日常护理-婴儿秤", "母婴-日用品-孕婴清洁护肤"],
      ["成长用品-日常护理-降温用品", "母婴-日用品-孕婴清洁护肤"],
      ["成长用品-日常护理-棉签/婴儿剪/梳子", "母婴-日用品-孕婴清洁护肤"],
      ["成长用品-日常护理-安全防护", "母婴-日用品-孕婴清洁护肤"],
      ["成长用品-日常护理-喂药器", "母婴-日用品-孕婴清洁护肤"],
      ["成长用品-日常护理-体温计", "母婴-日用品-孕婴清洁护肤"],
      ["成长用品-日常护理-如厕用品", "母婴-日用品-孕婴清洁护肤"],
      ["成长用品-日常护理-洗澡用品", "母婴-日用品-孕婴清洁护肤"],
      ["成长用品-日常护理-理发器", "母婴-日用品-孕婴清洁护肤"],
      ["玩具童车-婴儿车-手推车", "母婴-日用品-婴儿车"],
      ["玩具童车-婴儿车-自行车", "母婴-日用品-婴儿车"],
      ["玩具童车-婴儿车-学步车", "母婴-玩具-学步车"],
      ["玩具童车-婴儿车-三轮车", "母婴-日用品-婴儿车"],
      ["玩具童车-婴儿车-健身车", "母婴-日用品-婴儿车"],
      ["玩具童车-婴儿车-电动车", "母婴-日用品-婴儿车"],
      ["玩具童车-婴儿床椅-汽车座椅", "母婴-日用品-婴儿床"],
      ["玩具童车-婴儿床椅-婴儿床", "母婴-日用品-婴儿床"],
      ["玩具童车-婴儿床椅-摇椅", "母婴-日用品-婴儿床"],
      ["玩具童车-婴儿床椅-餐椅", "母婴-日用品-婴儿床"],
      ["玩具童车-启智玩具-积木拼插", "母婴-玩具-益智类"],
      ["玩具童车-启智玩具-情景模型", "母婴-玩具-模型玩具"],
      ["玩具童车-启智玩具-毛绒布艺", "母婴-玩具-毛绒玩具"],
      ["玩具童车-启智玩具-棋牌游戏", "母婴-玩具-益智类"],
      ["玩具童车-启智玩具-摇铃/床铃", "母婴-玩具-音乐玩具"],
      ["玩具童车-启智玩具-游戏垫", "母婴-玩具-动漫玩具"],
      ["玩具童车-启智玩具-画笔画架", "母婴-玩具-动漫玩具"],
      ["玩具童车-启智玩具-动漫角色", "母婴-玩具-动漫玩具"],
      ["玩具童车-启智玩具-戏水玩具", "母婴-玩具-戏水用品"],
      ["玩具童车-启智玩具-娃娃", "母婴-玩具-毛绒玩具"],
      ["玩具童车-启智玩具-DIY创意", "母婴-玩具-益智类"],
      ["玩具童车-启智玩具-运动户外", "母婴-玩具-户外玩具"],
      ["玩具童车-启智玩具-音乐玩具", "母婴-玩具-音乐玩具"],
      ["玩具童车-启智玩具-早教益智", "母婴-玩具-益智类"],
      ["玩具童车-启智玩具-木质玩具", "母婴-玩具-模型玩具"],
      ["玩具童车-启智玩具-遥控玩具", "母婴-玩具-遥控玩具"],
      ["玩具童车-手足印", "母婴-玩具-模型玩具"],
      ["玩具童车-文具用品", "母婴-玩具-益智类"],
      ["寝居服饰-儿童配饰-帽子/围巾", "鞋帽服饰-服饰配饰-帽子"],
      ["寝居服饰-儿童配饰-其他", "鞋帽服饰-服饰配饰-其他配饰"],
      ["寝居服饰-儿童配饰-袜子", "鞋帽服饰-服饰配饰-袜子"],
      ["寝居服饰-儿童配饰-手套", "鞋帽服饰-服饰配饰-手套"],
      ["寝居服饰-男童服饰-衬衣", "母婴-童装-衬衫"],
      ["寝居服饰-男童服饰-毛衣/针织衫", "母婴-童装-衬衫"],
      ["寝居服饰-男童服饰-裤装", "母婴-童装-亲子装"],
      ["寝居服饰-男童服饰-背心", "母婴-童装-亲子装"],
      ["寝居服饰-男童服饰-T恤", "母婴-童装-亲子装"],
      ["寝居服饰-男童服饰-外套/风衣", "母婴-童装-外套"],
      ["寝居服饰-男童服饰-棉服/羽绒服", "母婴-童装-外套"],
      ["寝居服饰-男童服饰-卫衣", "母婴-童装-外套"],
      ["寝居服饰-童鞋-冬鞋", "母婴-童装-童鞋"],
      ["寝居服饰-童鞋-运动鞋", "母婴-童装-童鞋"],
      ["寝居服饰-童鞋-皮鞋", "母婴-童装-童鞋"],
      ["寝居服饰-童鞋-凉鞋", "母婴-童装-童鞋"],
      ["寝居服饰-童鞋-休闲鞋", "母婴-童装-童鞋"],
      ["寝居服饰-女童服饰-裙装", "母婴-童装-裙子"],
      ["寝居服饰-女童服饰-裤装", "母婴-童装-亲子装"],
      ["寝居服饰-女童服饰-衬衣", "母婴-童装-亲子装"],
      ["寝居服饰-女童服饰-T恤", "母婴-童装-亲子装"],
      ["寝居服饰-女童服饰-毛衣/针织衫", "母婴-童装-亲子装"],
      ["寝居服饰-女童服饰-卫衣", "母婴-童装-亲子装"],
      ["寝居服饰-女童服饰-吊带/背心", "母婴-童装-亲子装"],
      ["寝居服饰-女童服饰-外套/风衣", "母婴-童装-亲子装"],
      ["寝居服饰-女童服饰-棉服/羽绒服", "母婴-童装-亲子装"],
      ["寝居服饰-婴幼儿服饰-礼盒套装", "母婴-童装-套装"],
      ["寝居服饰-婴幼儿服饰-连身衣/爬服", "母婴-童装-亲子装"],
      ["寝居服饰-婴幼儿服饰-食饭衫", "母婴-童装-围嘴"],
      ["寝居服饰-婴幼儿服饰-新生儿服装", "母婴-童装-亲子装"],
      ["寝居服饰-婴幼儿服饰-罩衣", "母婴-童装-围嘴"],
      ["寝居服饰-婴幼儿服饰-内衣", "母婴-童装-亲子装"],
      ["寝居服饰-婴幼儿服饰-口水巾/毛巾", "母婴-童装-围嘴"],
      ["寝居服饰-婴幼儿服饰-套装", "母婴-童装-套装"],
      ["寝居服饰-婴幼儿服饰-外衣", "母婴-童装-外套"],
      ["寝居服饰-宝宝寝居-睡枕", "家居家纺-家纺-枕芯枕套"],
      ["寝居服饰-宝宝寝居-床单/被罩", "家居家纺-家纺-床单"],
      ["寝居服饰-宝宝寝居-睡袋/抱被", "家居家纺-家纺-被子"],
      ["寝居服饰-宝宝寝居-床围", "家居家纺-家纺-其他"],
      ["寝居服饰-宝宝寝居-床垫/抱枕", "家居家纺-家纺-抱枕坐垫"],
      ["寝居服饰-宝宝寝居-被褥/毛毯", "家居家纺-家纺-毯子/床垫"],
      ["寝居服饰-宝宝寝居-寝具礼盒", "家居家纺-家纺-其他"],
      ["寝居服饰-宝宝寝居-浴巾/毛巾", "家居家纺-家纺-毛巾浴巾"],
      ["寝居服饰-宝宝寝居-凉席/蚊帐", "家居家纺-家纺-蚊帐/凉席"],
      ["寝居服饰-宝宝金饰-宝宝储备金牌", "珠宝配饰-金银首饰-黄金铂金"],
      ["寝居服饰-宝宝金饰-宝宝祈福金饰", "珠宝配饰-金银首饰-黄金铂金"],
      ["图书城-音像-语言类", "母婴-益智早教-早教机"],
      ["图书城-音像-卡通/动漫", "母婴-益智早教-早教机"],
      ["图书城-音像-音乐/舞蹈", "母婴-益智早教-早教机"],
      ["图书城-音像-少儿英语", "母婴-益智早教-早教机"],
      ["图书城-家庭教育-家教方法", "母婴-益智早教-早教书籍"],
      ["图书城-小说-侦探/悬疑/推理", "母婴-益智早教-早教书籍"],
      ["图书城-小说-中国当代小说", "母婴-益智早教-早教书籍"],
      ["图书城-小说-社会", "母婴-益智早教-早教书籍"],
      ["图书城-小说-官场", "母婴-益智早教-早教书籍"],
      ["图书城-小说-魔幻", "母婴-益智早教-早教书籍"],
      ["图书城-小说-科幻", "母婴-益智早教-早教书籍"],
      ["图书城-小说-职场", "母婴-益智早教-早教书籍"],
      ["图书城-少儿-点读笔", "母婴-益智早教-早教书籍"],
      ["图书城-少儿-益智游戏", "母婴-益智早教-早教书籍"],
      ["图书城-少儿-动漫/卡通", "母婴-益智早教-早教书籍"],
      ["图书城-少儿-早教套装", "母婴-益智早教-早教书籍"],
      ["图书城-少儿-幼儿启蒙", "母婴-益智早教-早教书籍"],
      ["图书城-少儿-科普/百科", "母婴-益智早教-早教书籍"],
      ["图书城-孕产妇/育儿-孕产妇健康", "母婴-益智早教-早教书籍"],
      ["图书城-孕产妇/育儿-早教指南", "母婴-益智早教-早教书籍"],
      ["图书城-孕产妇/育儿-孕产百科", "母婴-益智早教-早教书籍"],
      ["图书城-孕产妇/育儿-儿童营养饮食", "母婴-益智早教-早教书籍"],
      ["图书城-孕产妇/育儿-儿童疾病防治", "母婴-益智早教-早教书籍"],
      ["图书城-孕产妇/育儿-育儿百科", "母婴-益智早教-早教书籍"],
      ["图书城-保健/心理健康-健康百科", "母婴-益智早教-早教书籍"],
      ["图书城-家居/休闲游戏-品质生活", "母婴-益智早教-早教书籍"],
      ["图书城-家居/休闲游戏-杂志", "母婴-益智早教-早教书籍"]
    ]
    def belongs_to_categories
      doc.css(".globalCurrentCrumb a").select{|elem| elem["href"] && elem["href"] != "http://www.redbaby.com.cn/" && elem["href"].to_s !~ /brand|html/}.map do |elem|
        {
          :name => elem.inner_text,
          :url  => elem["href"]
        }
      end
    end

		def title
			doc.css(".productName h1").text
		end

		def price
			str = doc.css(".price span").text.match(/[\d|\.]+$/)[0]
			return str.to_f
		end

		def stock
			return 1
		end

		def image_url
			img = doc.css(".jqzoom img").first["src"]
		end

		def desc
		end

		def price_url
		end

		def score

		end

		def product_code
		end
		
		def standard
		end
		
		def comments
			content_elems = doc.css(".productCommentsInfo")
			publish_at_elems = doc.css(".productCommentsTime")
			(0...content_elems.count).map do |index|
				{
					publish_at: publish_at_elems[index].inner_text,
					content: content_elems[index].inner_text
				}
			end	
		end
		
		def end_product
      route_str = product.page.category.ancestors_and_self.map do |cate|
        cate.name
      end.join("-")
      puts route_str
      origin_base_map(CATEGORY_MAP,route_str)
		end
		
		def merchant
      get_merchant("红孩子")
		end
		
		def brand
		end

		def brand_type
		end

		def get_union_url
      product.url+"?Source=65850"
		end

		def get_order_num
      route_str = product.page.category.ancestors_and_self.map do |cate|
        cate.name
      end.join("-")

      order_num_end_product = origin_base_map(CATEGORY_MAP,route_str)

      if order_num_end_product.nil?
        10000000
      else
        order_num_end_product.order_num
      end
		end

	end
end
