#encoding: utf-8
require 'nokogiri'

module Spider
  class VjiaParser < Parser
    CATEGORY_MAP = [
["男装-T恤-长袖T恤", "服装-男装-T恤"],
["男装-T恤-短袖T恤", "服装-男装-T恤"],
["男装-T恤-背心", "服装-内衣袜品-背心"],
["男装-POLO衫-长袖POLO衫", "服装-男装-衬衫"],
["男装-POLO衫-短袖POLO衫", "服装-男装-衬衫"],
["男装-衬衫-长袖衬衫", "服装-男装-衬衫"],
["男装-衬衫-短袖衬衫", "服装-男装-衬衫"],
["男装-针织衫-套头衫", "服装-男装-针织"],
["男装-针织衫-针织开衫", "服装-男装-针织"],
["男装-针织衫-针织背心", "服装-男装-针织"],
["男装-针织衫-羊绒衫/羊毛衫", "服装-男装-针织"],
["男装-外套-夹克", "服装-男装-上衣外套"],
["男装-外套-卫衣", "服装-男装-上衣外套"],
["男装-外套-西服", "服装-男装-上衣外套"],
["男装-外套-风衣", "服装-男装-上衣外套"],
["男装-外套-大衣", "服装-男装-上衣外套"],
["男装-外套-皮衣", "服装-男装-上衣外套"],
["男装-外套-马夹", "服装-男装-上衣外套"],
["男装-外套-羽绒服", "服装-男装-上衣外套"],
["男装-外套-棉服", "服装-男装-上衣外套"],
["男装-裤子-休闲裤", "服装-男装-裤子"],
["男装-裤子-牛仔裤", "服装-男装-裤子"],
["男装-裤子-西裤", "服装-男装-裤子"],
["男装-裤子-短裤/中裤", "服装-男装-裤子"],
["男装-内衣-男士内裤", "服装-内衣袜品-内裤"],
["男装-内衣-情趣内衣", "服装-内衣袜品-情趣内衣"],
["男装-内衣-家居服", "服装-内衣袜品-家居服"],
["男装-内衣-袜子", "服装-内衣袜品-袜子"],
["男装-配饰-腰带", "鞋帽服饰-服饰配饰-腰带"],
["男装-配饰-眼镜", "鞋帽服饰-服饰配饰-眼镜"],
["男装-配饰-领带", "鞋帽服饰-服饰配饰-领带"],
["男装-配饰-帽子", "鞋帽服饰-服饰配饰-帽子"],
["女装-衬衫-长袖衬衫", "服装-女装-衬衫"],
["女装-衬衫-短袖衬衫", "服装-女装-衬衫"],
["女装-衬衫-中袖衬衫", "服装-女装-衬衫"],
["女装-T恤-长袖T恤", "服装-女装-T恤"],
["女装-T恤-短袖T恤", "服装-女装-T恤"],
["女装-T恤-吊带/背心", "服装-内衣袜品-吊带"],
["女装-POLO衫-POLO衫", "服装-女装-衬衫"],
["女装-针织衫-套头针织衫", "服装-女装-针织衫"],
["女装-针织衫-针织开衫", "服装-女装-针织衫"],
["女装-针织衫-短袖针织衫", "服装-女装-针织衫"],
["女装-针织衫-羊毛/羊绒衫", "服装-女装-针织衫"],
["女装-裤子-牛仔裤", "服装-女装-裤子"],
["女装-裤子-连身裤", "服装-女装-裤子"],
["女装-裤子-休闲裤", "服装-女装-裤子"],
["女装-裤子-分裤", "服装-女装-裤子"],
["女装-裤子-短裤", "服装-女装-裤子"],
["女装-裤子-西裤", "服装-女装-裤子"],
["女装-裤子-打底裤", "服装-女装-裤子"],
["女装-裙子-半裙", "服装-女装-裙子"],
["女装-裙子-连衣裙", "服装-女装-裙子"],
["女装-裙子-吊带裙", "服装-女装-裙子"],
["女装-外套-羽绒服", "服装-女装-外套"],
["女装-外套-棉服", "服装-女装-外套"],
["女装-外套-短外套", "服装-女装-外套"],
["女装-外套-卫衣", "服装-女装-外套"],
["女装-外套-马甲", "服装-女装-外套"],
["女装-外套-皮衣/皮草", "服装-女装-外套"],
["女装-外套-夹克", "服装-女装-外套"],
["女装-外套-西装", "服装-女装-西服/套装"],
["女装-外套-风衣", "服装-女装-皮衣"],
["女装-外套-大衣", "服装-女装-皮衣"],
["内衣-文胸", "服装-内衣袜品-文胸"],
["内衣-基础打底/内衣套装", "服装-内衣袜品-睡衣"],
["内衣-睡衣/家居服", "服装-内衣袜品-睡衣"],
["内衣-情趣内衣", "服装-内衣袜品-情趣内衣"],
["内衣-美体/隐形内衣", "服装-内衣袜品-情趣内衣"],
["内衣-内裤", "服装-内衣袜品-内裤"],
["内衣-棉袜", "服装-内衣袜品-袜子"],
["内衣-裤袜/丝袜", "服装-内衣袜品-袜子"],
["配饰-饰品-戒指", "珠宝配饰-饰品配饰-戒指"],
["配饰-饰品-耳饰", "珠宝配饰-饰品配饰-耳环/耳饰"],
["配饰-饰品-手链/手镯", "珠宝配饰-饰品配饰-手链/脚链"],
["配饰-饰品-发饰", "珠宝配饰-钻石珠宝-发饰"],
["配饰-饰品-项链/吊坠", "珠宝配饰-饰品配饰-项链/项坠"],
["配饰-帽子-针织帽", "鞋帽服饰-服饰配饰-帽子"],
["配饰-眼镜-防辐射眼镜", "鞋帽服饰-服饰配饰-眼镜"],
["配饰-腰带/腰封", "鞋帽服饰-服饰配饰-腰带"],
["配饰-围巾/脖套", "鞋帽服饰-服饰配饰-围巾"],
["运动户外-运动服-T恤/背心", "服装-运动服装-运动T恤"],
["运动户外-运动服-POLO衫", "服装-运动服装-运动休闲"],
["运动户外-运动服-夹克", "服装-运动服装-运动外套"],
["运动户外-运动服-卫衣", "服装-运动服装-卫衣"],
["运动户外-运动服-长裤", "服装-运动服装-运动裤"],
["运动户外-运动服-分裤/短裤", "服装-运动服装-运动裤"],
["运动户外-运动服-裙子", "服装-运动服装-运动裤"],
["运动户外-运动服-瑜伽服", "运动户外-运动名品-瑜珈用品"],
["运动户外-运动服-泳装", "运动户外-运动名品-游泳用品"],
["运动户外-运动服-羽绒服", "服装-运动服装-棉服"],
["运动户外-运动鞋-板鞋", "鞋帽服饰-运动休闲鞋-板鞋"],
["运动户外-运动鞋-帆布鞋/硫化鞋", "鞋帽服饰-运动休闲鞋-帆布鞋  "],
["运动户外-运动鞋-休闲运动鞋", "鞋帽服饰-运动休闲鞋-休闲鞋"],
["运动户外-运动鞋-足球鞋", "鞋帽服饰-运动休闲鞋-足球鞋"],
["运动户外-运动鞋-跑步鞋", "鞋帽服饰-运动休闲鞋-跑步鞋"],
["运动户外-运动鞋-篮球鞋", "鞋帽服饰-运动休闲鞋-篮球鞋"],
["运动户外-运动鞋-网球鞋", "运动户外-运动名品-网球用品"],
["运动户外-运动鞋-训练鞋", "运动户外-运动名品-运动鞋"],
["运动户外-运动鞋-凉鞋/拖鞋", "鞋帽服饰-其他鞋-凉鞋"],
["运动户外-运动户外包-腰包/挎包", "箱包皮具-旅行箱包-腰包"],
["运动户外-运动户外包-休闲背包", "箱包皮具-旅行箱包-休闲包"],
["运动户外-运动户外包-户外背包", "运动户外-户外装备-户外背包"],
["运动户外-户外服装-速干衣", "服装-运动服装-运动外套"],
["运动户外-户外服装-冲锋衣", "服装-运动服装-运动外套"],
["运动户外-户外服装-抓绒衣", "服装-运动服装-运动外套"],
["运动户外-户外服装-户外鞋", "运动户外-运动名品-运动鞋"],
["运动户外-户外服装-滑雪服", "运动户外-户外装备-滑雪"],
["运动户外-户外服装-棉服/羽绒服", "服装-运动服装-棉服"],
["运动户外-装备配件-帽子", "鞋帽服饰-服饰配饰-帽子"],
["运动户外-装备配件-瑜伽周边", "运动户外-运动名品-瑜珈用品"],
["运动户外-装备配件-帐篷/睡袋/吊床", "运动户外-户外装备-帐篷"],
["运动户外-装备配件-野餐用具", "运动户外-户外装备-野餐炊具"],
["运动户外-装备配件-泳具", "运动户外-运动名品-游泳用品"],
["运动户外-装备配件-其他配件", "运动户外-运动名品-其他用品"],
["箱包-潮流女包-单肩包", "箱包皮具-潮流女包-单肩包"],
["箱包-潮流女包-斜挎包", "箱包皮具-潮流女包-斜挎包"],
["箱包-潮流女包-手提/斜跨包", "箱包皮具-潮流女包-手提/斜挎两用包"],
["箱包-潮流女包-手拿包", "箱包皮具-潮流女包-手包"],
["箱包-精品男包-单肩/斜挎包", "箱包皮具-时尚男包-斜肩包"],
["箱包-精品男包-手提/斜跨包", "箱包皮具-时尚男包-斜肩包"],
["箱包-精品男包-手包", "箱包皮具-时尚男包-手包"],
["箱包-箱包-休闲包/双肩包", "箱包皮具-旅行箱包-双肩包"],
["箱包-箱包-电脑/公文包", "箱包皮具-时尚男包-电脑数码包"],
["箱包-箱包-多功能包/数码配件包", "箱包皮具-旅行箱包-多功能背包"],
["箱包-箱包-钱包/零钱包/钥匙包", "箱包皮具-时尚男包-钱包"],
["箱包-箱包-卡包/名片夹", "箱包皮具-时尚男包-经典商务包"],
["箱包-箱包-化妆包/洗漱包", "箱包皮具-潮流女包-化妆包"],
["箱包-箱包-旅行箱包", "箱包皮具-旅行箱包-拉杆箱"],
["箱包-箱包-妈咪包/亲子包", "箱包皮具-潮流女包-妈咪/学生包"],
["鞋靴-男鞋-休闲皮鞋", "鞋帽服饰-运动休闲鞋-休闲鞋"],
["鞋靴-男鞋-商务皮鞋", "鞋帽服饰-其他鞋-靴子"],
["鞋靴-男鞋-男靴", "鞋帽服饰-其他鞋-靴子"],
["鞋靴-男鞋-凉鞋/凉拖", "鞋帽服饰-其他鞋-凉鞋"],
["鞋靴-男鞋-运动休闲", "鞋帽服饰-运动休闲鞋-休闲鞋"],
["鞋靴-女鞋-凉拖", "鞋帽服饰-其他鞋-拖鞋"],
["鞋靴-女鞋-凉鞋", "鞋帽服饰-其他鞋-凉鞋"],
["鞋靴-女鞋-单鞋", "鞋帽服饰-其他鞋-单鞋"],
["鞋靴-女鞋-休闲皮鞋", "鞋帽服饰-运动休闲鞋-休闲鞋"],
["鞋靴-女鞋-靴子", "鞋帽服饰-其他鞋-靴子"],
["鞋靴-女鞋-运动休闲", "鞋帽服饰-运动休闲鞋-跑步鞋"],
["鞋靴-家居鞋-棉拖", "鞋帽服饰-其他鞋-拖鞋"],
["家纺-布艺家纺-床品套件", "家居家纺-家纺-床品件套"],
["家纺-布艺家纺-被芯/被褥", "家居家纺-家纺-被子"],
["家纺-布艺家纺-毛毯/绒毯", "家居家纺-家纺-毯子/床垫"],
["家纺-布艺家纺-枕头/保健枕/枕套", "家居家纺-家纺-枕芯枕套"],
["家纺-布艺家纺-抱枕/靠垫/坐垫/充气垫", "家居家纺-家纺-抱枕坐垫"],
["家纺-布艺家纺-毛巾/浴巾", "家居家纺-家纺-毛巾浴巾"],
["家纺-布艺家纺-凉席/蚊帐", "家居家纺-家纺-蚊帐/凉席"],
["家纺-布艺家纺-地垫/地毯", "家居家纺-家纺-毯子/床垫"],
["家纺-居家日用-收纳/整理", "家居家纺-生活日用-收纳雨具"],
["家纺-居家日用-装饰/摆件", "家居家纺-灯具-装饰灯"],
["家纺-居家日用-净化防潮", "家居家纺-生活日用-净化防潮"],
["家纺-居家日用-雨具/伞", "家居家纺-生活日用-收纳雨具"],
["家纺-居家日用-洗晒用品", "家居家纺-生活日用-洗晒用品"],
["家纺-厨卫用品-餐具/杯具/厨具", "家居家纺-厨房用具-厨具用品"],
["家纺-厨卫用品-餐垫/杯垫/围裙", "家居家纺-厨房用具-厨用小件"],
["家纺-厨卫用品-厨用小件", "家居家纺-厨房用具-厨用小件"],
["家纺-厨卫用品-厨房清洁", "家居家纺-清洁用品-厨房清洁"],
["家纺-厨卫用品-卫浴清洁", "家居家纺-清洁用品-卫浴清洁"],
["家纺-厨卫用品-保鲜盒/保温袋", "家居家纺-厨房用具-保鲜盒"],
["家纺-厨卫用品-卫浴小件", "家居家纺-清洁用品-卫浴清洁"],
["家纺-护理保健-护理保健", "美容护肤-身体护理-个护保健"],
["家纺-创意礼品-创意办公", "其他-礼品/礼物-其他礼品"],
["美妆-面部护理-洁面/卸妆", "美容护肤-日常护肤-洁面"],
["美妆-面部护理-化妆水/爽肤水", "美容护肤-日常护肤-护肤水"],
["美妆-面部护理-乳液/面霜", "美容护肤-日常护肤-乳液"],
["美妆-面部护理-精华", "美容护肤-日常护肤-精华"],
["美妆-面部护理-眼霜/眼胶", "美容护肤-日常护肤-眼部"],
["美妆-面部护理-面膜/颈膜", "美容护肤-日常护肤-面膜"],
["美妆-面部护理-防晒/修复", "美容护肤-魅力彩妆-防晒霜"],
["美妆-面部护理-按摩/角质/黑头", "美容护肤-日常护肤-去角质"],
["美妆-面部护理-护理套装", "美容护肤-日常护肤-套装"],
["美妆-面部护理-祛痘/淡斑", "美容护肤-日常护肤-洁面"],
["美妆-彩妆-隔离/BB霜/妆前乳", "美容护肤-魅力彩妆-隔离霜"],
["美妆-彩妆-粉底/粉饼/散粉", "美容护肤-魅力彩妆-粉饼"],
["美妆-彩妆-眼影/眼线", "美容护肤-魅力彩妆-眼影"],
["美妆-彩妆-唇部彩妆", "美容护肤-魅力彩妆-眼唇妆"],
["美妆-彩妆-睫毛膏", "美容护肤-魅力彩妆-睫毛膏"],
["美妆-彩妆-腮红", "美容护肤-魅力彩妆-腮红胭脂"],
["美妆-彩妆-眉笔/眉粉", "美容护肤-日常护肤-眼部"],
["美妆-个人洗护-沐浴/润肤", "美容护肤-身体护理-沐浴"],
["美妆-个人洗护-洗发/护发", "美容护肤-身体护理-洗发护发"],
["美妆-个人洗护-口腔护理", "美容护肤-身体护理-口腔手足"],
["美妆-个人洗护-手足护理", "美容护肤-身体护理-口腔手足"],
["美妆-个人洗护-染烫/造型", "美容护肤-身体护理-其他"],
["美妆-个人洗护-美体塑身", "美容护肤-身体护理-美体瘦身"],
["美妆-个人洗护-特殊护理", "美容护肤-身体护理-个护保健"],
["美妆-个人洗护-香皂/手工皂", "美容护肤-身体护理-沐浴"],
["美妆-香水/SPA-精油", "美容护肤-日常护肤-精油"],
["美妆-香水/SPA-香水", "美容护肤-身体护理-香体止汗"],
["美妆-美容工具", "美容护肤-魅力彩妆-美容工具"],
["美妆-男士专区", "美容护肤-身体护理-其他"],
["美妆-婴童专区", "美容护肤-身体护理-其他"],
["明星&设计师品牌-上衣-T恤", "服装-运动服装-运动T恤"],
["明星&设计师品牌-上衣-Polo衫", "服装-运动服装-运动休闲"],
["明星&设计师品牌-上衣-衬衫", "服装-运动服装-运动休闲"],
["明星&设计师品牌-上衣-卫衣/帽衫", "服装-运动服装-卫衣"],
["明星&设计师品牌-上衣-毛衣/针织衫", "服装-运动服装-运动休闲"],
["明星&设计师品牌-上衣-外套", "服装-运动服装-运动外套"],
["明星&设计师品牌-上衣-马夹", "服装-运动服装-运动外套"],
["明星&设计师品牌-裤子-牛仔裤", "服装-运动服装-运动裤"],
["明星&设计师品牌-裤子-休闲裤/工装裤", "服装-特色服装-休闲装"],
["明星&设计师品牌-裤子-短裤/中裤", "服装-运动服装-运动裤"],
["明星&设计师品牌-裤子-内裤", "服装-内衣袜品-内裤"],
["明星&设计师品牌-鞋-鞋", "鞋帽服饰-其他鞋-靴子"],
["明星&设计师品牌-包袋-双肩包", "箱包皮具-旅行箱包-双肩包"],
["明星&设计师品牌-包袋-斜挎包", "箱包皮具-时尚男包-斜肩包"],
["明星&设计师品牌-包袋-手提包袋/手包", "箱包皮具-潮流女包-手提包"],
["明星&设计师品牌-包袋-钥匙包/钱包", "箱包皮具-时尚男包-钥匙包"],
["明星&设计师品牌-包袋-化妆包", "箱包皮具-潮流女包-化妆包"],
["明星&设计师品牌-配饰-帽子", "鞋帽服饰-服饰配饰-帽子"],
["明星&设计师品牌-配饰-腰带", "鞋帽服饰-服饰配饰-腰带"],
["明星&设计师品牌-配饰-饰品", "珠宝配饰-饰品配饰-其他配饰"],
["明星&设计师品牌-潮流家居-居家日用", "家居家纺-生活日用-清洁工具"],
["明星&设计师品牌-潮流家居-学习用品", "学习教育-文具用品-其他学习用品"],
["明星&设计师品牌-潮流家居-玩偶", "母婴-玩具-模型玩具"],
["母婴童装-玩具/早教-毛绒/玩偶/娃娃", "母婴-玩具-毛绒玩具"],
["母婴童装-玩具/早教-益智学习", "母婴-玩具-益智类"],
["母婴童装-儿童服饰-T恤","母婴-童装-T恤"],
["母婴童装-儿童服饰-衬衫","母婴-童装-衬衫"],
["母婴童装-儿童服饰-裙子","母婴-童装-裙子"],
["母婴童装-儿童服饰-裤子","母婴-童装-裤子"],
["母婴童装-儿童服饰-外套","母婴-童装-外套"],
["母婴童装-儿童服饰-针织衫","母婴-童装-套装"],
["母婴童装-儿童服饰-棉服/羽绒服","母婴-童装-外套"],
["母婴童装-儿童服饰-童鞋","母婴-童装-童鞋"],
["母婴童装-儿童服饰-套装","母婴-童装-套装"],
["母婴童装-儿童服饰-婴儿装","母婴-童装-婴儿装"],
["母婴童装-孕妈专区-防辐射服","母婴-妈妈专区-防辐射服"]
]  
		def belongs_to_categories
          product.cate_path
		end

    def title
	  doc.css("div#FreshDiv_ProductName h2").text.gsub("\r\n","").strip
    end

    def price
	  # 有售价和促销价之分
      doc.css("div.MpriceArea strong span#SpecialPrice").present? ? doc.css("div.MpriceArea strong span#SpecialPrice").text.to_f : doc.css("span#SellPrice").text.to_f 
		end

  	def stock
		  return 1 
  	end

  	def image_url
		  img = doc.css("div.bigImg img").first["src"] if doc.css("div.bigImg img").first
		end

		def desc
		  doc.css("div.conOne div[class=goodsSx] p").to_html
		end

		def price_url

		end

		def score
		  doc.css("li.star5 label.star").first["class"][/\d+/, 0].to_i if doc.css("li.star5 label.star").first.present?
		end

		def product_code
		  #doc.css("div.brandArea span").last.inner_text.split("商品编号：")[-1].to_s
		end

		def standard

		end
		


		def comments
		#  content_elems = doc.css("#CommentList dl dd p")
		#  publish_at_elems = doc.css("#CommentList dl dt span")
		# (1..content_elems.count).map do |index|
		#   {
		#		publish_at: publish_at_elems[index][0],
		#		content: content_elems[index].inner_text.split("(")[0]
		#	}
		  #end	
		end

		def end_product
      route_str = product.page.category.ancestors_and_self.map do |cate|
        cate.name
      end.join("-")
      puts route_str
      origin_base_map(CATEGORY_MAP,route_str)
		end

		def merchant
                  return Merchant.find(BSON::ObjectId("4e53c0aa1d41c862fc00057e"))
		end

		def brand
		#  doc.css("div.brandArea span strong a").inner_text
		end

		def brand_type
		end

    def get_order_num
      route_str = product.page.category.ancestors_and_self.map do |cate|
        cate.name
      end.join("-")

      order_num_end_product = origin_base_map(CATEGORY_MAP,route_str)

      if order_num_end_product.nil?
        10000000
      else
        order_num_end_product.order_num
      end

    end

    def get_union_url
      "http://www.vjia.com/WebSource/WebSource.aspx?source=findbest360&url="+product.url
    end
	end
end
